src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <predefined>
    <items>
      <name>Товар</name>
      <description>Товар</description>
    </items>
    <items>
      <name>Услуга</name>
      <description>Услуга</description>
    </items>
  </predefined>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр) Весовой коэффициент вхождения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидГруза</name>
    <type>
      <types>CatalogRef.уатВидыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидУпаковкиДляРоссыпи</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидУпаковкиОсновной</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКоличествоВОсновнойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатКоличествоВУпаковкеДляРоссыпи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаРегл</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЭтикетокДляКаждойЕдиницыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВидыНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВыполнитьПроверкуКлючевыхРеквизитов(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПроверкуКлючевыхРеквизитов(Отказ)

	Если ЭтоНовый() тогда
		// В случае нового вида номенклатуры не производить проверку
		Возврат;
	КонецЕсли;

	// Получим значения реквизитов вида номенклатуры из информационной базы
	УслугаИзИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Услуга");

	Если УслугаИзИБ = Услуга тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, можно ли изменять признак услуга.
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ Номенклатура.ЭтоГруппа";
		
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя изменять признак ""Услуга"" если есть номенклатура данного вида.'"); 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность", 
			НСтр("ru = 'Услуга'"), , , ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Услуга", "Объект", Отказ);
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
